In [3]:
import numpy as np
import pandas as pd

df = pd.read_csv('president_heights.csv')

In [4]:
df.head(10)

   order                    name  height(cm)
0      1       George Washington         189
1      2              John Adams         170
2      3        Thomas Jefferson         189
3      4           James Madison         163
4      5            James Monroe         183
5      6       John Quincy Adams         171
6      7          Andrew Jackson         185
7      8        Martin Van Buren         168
8      9  William Henry Harrison         173
9     10              John Tyler         183

In [5]:
df.tail(10)

    order               name  height(cm)
32     35    John F. Kennedy         183
33     36  Lyndon B. Johnson         193
34     37      Richard Nixon         182
35     38        Gerald Ford         183
36     39       Jimmy Carter         177
37     40      Ronald Reagan         185
38     41  George H. W. Bush         188
39     42       Bill Clinton         188
40     43     George W. Bush         182
41     44       Barack Obama         185

In [6]:
df.shape

(42, 3)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       42 non-null     int64
 1   name        42 non-null     object
 2   height(cm)  42 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB

In [8]:
df.describe()

           order  height(cm)
count  42.000000   42.000000
mean   22.476190  179.738095
std    13.152461    7.015869
min     1.000000  163.000000
25%    11.250000  174.250000
50%    22.000000  182.000000
75%    33.750000  183.000000
max    44.000000  193.000000

In [9]:
df.isnull().sum()

order         0
name          0
height(cm)    0
dtype: int64

In [10]:
df['height(cm)'].value_counts()

183    8
178    4
173    4
182    4
188    3
185    3
193    2
189    2
175    2
170    2
168    2
163    1
179    1
180    1
174    1
171    1
177    1
Name: height(cm), dtype: int64

In [11]:
# 키에 대한 평균
df['height(cm)'].mean()

179.73809523809524

In [15]:
# 키에 대한 최소값
df['height(cm)'].min()

163

In [16]:
# 키에 대한 최대값
df['height(cm)'].max()

193

In [17]:
# 상관계수
df.corr()

               order  height(cm)
order       1.000000    0.355836
height(cm)  0.355836    1.000000

- 넘파이로 EDA작업보다는 판다스가 더 접근하기 쉽다.